import numpy as np
# вводим размеры матрицы
u = int(input("Введите количество строк U: "))
j = int(input("Введите количество столбцов J: "))
b = np.random.randint(1, 10, size=(u, j)) # создаем матрицу из рандомных чисел
print("Исходная матрица:")
print(b)
c = b.T #транспонированная матрица
print("Транспонированная матрица:")
print(c)
if u == j: #проверяем квадратная матрица или нет
    det1 = np.linalg.det(b) # определитель первой
    det2 = np.linalg.det(c) # определитель второй
    print("Определитель исходной матрицы:", det1)
    print("Определитель транспонированной матрицы:", det2) 
    if det1 == det2: # сравниваем
        print("Определители равны ")
    else:
        print("Определители разные ")
else:
    print("Матрица не квадратная, определитель посчитать нельзя")
